Folders.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-29 Wed 20:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Folders</title>
<meta name="author" content="Paige Roy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Folders</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95e56d9">1. navigation</a>
<ul>
<li><a href="#org7b324a8">1.1. cd</a></li>
<li><a href="#org8f436ea">1.2. ls</a></li>
</ul>
</li>
<li><a href="#orgb41f19e">2. reading</a>
<ul>
<li><a href="#orgb8263c2">2.1. cat</a></li>
<li><a href="#orge2d2eda">2.2. more</a></li>
</ul>
</li>
<li><a href="#org11d17f4">3. creation</a>
<ul>
<li><a href="#org7a4d525">3.1. cp</a></li>
<li><a href="#orgc0f77df">3.2. mv</a></li>
<li><a href="#orgb5965fb">3.3. rsync</a></li>
</ul>
</li>
<li><a href="#org9693de6">4. go over use flags</a></li>
</ul>
</div>
</div>
<p>
EVERYTHING IS A FILE. Even folders. Folders are just special files
which point to other files. That being said, we will learn about
navigating folders, making folders, editing folders, etc.
</p>
<div id="outline-container-org95e56d9" class="outline-2">
<h2 id="org95e56d9"><span class="section-number-2">1.</span> navigation</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7b324a8" class="outline-3">
<h3 id="org7b324a8"><span class="section-number-3">1.1.</span> cd</h3>
<div class="outline-text-3" id="text-1-1">
<p>
'cd' is a very very simple program. It changes the current directory
to the directory name specified like so: 'cd [path]'. To go back a
directory you can use 'cd ..'
</p>
</div>
</div>
<div id="outline-container-org8f436ea" class="outline-3">
<h3 id="org8f436ea"><span class="section-number-3">1.2.</span> ls</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The ls command lists informations about files. To simply list the files
inside the current directory use 'ls'. To see hidden files (files with
a . in front of them) use 'ls -a'. To list more information use the -l
flag. To check the size in easily readable units use the -lh flags.
Use the -d flag to list directories instead of files. To sort by
largest file first add the -S flag.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb41f19e" class="outline-2">
<h2 id="orgb41f19e"><span class="section-number-2">2.</span> reading</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb8263c2" class="outline-3">
<h3 id="orgb8263c2"><span class="section-number-3">2.1.</span> cat</h3>
<div class="outline-text-3" id="text-2-1">
<p>
To view the contents of a file, you can use the cat command and then
specify the files name. Super simple. To make a file using cat use
the command 'cat &gt;[file]' and to copy data from one file to another
file use 'cat [file A]&gt;[file B]'
</p>
</div>
</div>
<div id="outline-container-orge2d2eda" class="outline-3">
<h3 id="orge2d2eda"><span class="section-number-3">2.2.</span> more</h3>
<div class="outline-text-3" id="text-2-2">
<p>
more can be used to quickly check through a files content
</p>
</div>
</div>
</div>
<div id="outline-container-org11d17f4" class="outline-2">
<h2 id="org11d17f4"><span class="section-number-2">3.</span> creation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7a4d525" class="outline-3">
<h3 id="org7a4d525"><span class="section-number-3">3.1.</span> cp</h3>
<div class="outline-text-3" id="text-3-1">
<p>
cp is the command to copy one folder from a location to another.
It is used like 'cp [file] [file]'. To copy a whole directory
to another location pass the -a flag.
</p>
</div>
</div>
<div id="outline-container-orgc0f77df" class="outline-3">
<h3 id="orgc0f77df"><span class="section-number-3">3.2.</span> mv</h3>
<div class="outline-text-3" id="text-3-2">
<p>
mv is just like the cp command, except it deletes the original file
when moving it to the new location.
</p>
</div>
</div>
<div id="outline-container-orgb5965fb" class="outline-3">
<h3 id="orgb5965fb"><span class="section-number-3">3.3.</span> rsync</h3>
<div class="outline-text-3" id="text-3-3">
<p>
If you're moving larger files, or want to actually see a progress bar
while the transfer is happening, you can use rsync while passing it
the &#x2013;progress flag. 
</p>
</div>
</div>
</div>
<div id="outline-container-org9693de6" class="outline-2">
<h2 id="org9693de6"><span class="section-number-2">4.</span> go over use flags</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paige Roy</p>
<p class="date">Created: 2023-03-29 Wed 20:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
